Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.#ctor(ADocument*,RoomElem*)
Construction

Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.DeleteConstruction(Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction)
Remove an existing construction from Space constructions.
pCurrentConstruction: The Construction will be deleted.

Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.DuplicateConstruction(Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction,System.String)
Create a new construction for Space constructions.
pCurrentConstruction: The existing construction to be duplicated.
pName: The name of the new construction.
Remarks: If the name is same with the existing one, an exception will be thrown.

Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.NewConstruction(System.String)
Create a new construction for Space constructions.
pName: The name of the new Construction.
Remarks: If the name is same as an existing one, an exception will be thrown.

Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.SpaceConstructions
Return all the Space constructions of current space.
pName: The name of the new Construction.
Remarks: If the name is same with the existing one, an exception will be thrown.

Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.CurrentConstruction
Get all the Building Constructions according to the specific Construction type.
constructionType: The Construction Type to be set the Building Construction.
Remarks: This property is used to get or set the Building Service of the Project Information.

Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction
Construction definition for Space.
Remarks: This is used to define the information in Constructions.xml.